[
  {
    "section_text": "Quality of video's visual effect",
    "question_text": "[visual quality] The visual quality (sharpness, resolution) was good enough to see details clearly.",
    "options":[
      {"key":"option_1", "value":"1 = Very low quality – Blurry, pixelated, hard to watch."},
      {"key":"option_2", "value":"2 = Somewhat low quality – Somewhat visible, but poor resolution."},
      {"key":"option_3", "value":"3 = Acceptable – Not great, but I could see most of what I needed."},
      {"key":"option_4", "value":"4 = High quality – Just a tiny bit of room for improvement."},
      {"key":"option_5", "value":"5 = Perfect – Crystal clear, very sharp visuals."}
    ]
  },
  {
    "section_text": "Quality of video's visual effect",
    "question_text": "[Visual realism] The video looks realistic — the people, objects, and movements appear natural and believable.",
    "options":[
      {"key":"option_1", "value":"1 = Very fake – Obvious distortions like warped hands, jerky motion, or uncanny faces."},
      {"key":"option_2", "value":"2 = Fake-looking – Multiple elements feel off or computer-generated."},
      {"key":"option_3", "value":"3 = Somewhat realistic – Mostly fine, but with one or two noticeably odd visuals."},
      {"key":"option_4", "value":"4 = Realistic – Everything looks mostly natural."},
      {"key":"option_5", "value":"5 = Highly realistic – Nothing looks off; the visuals are convincingly human and real."}
    ]
  },
  {
    "section_text": "Quality of video's visual effect",
    "question_text": "[Realisticness of transition] The video makes sense in terms of time and continuity — it doesn’t feel like it jumps abruptly or unnaturally.",
    "options":[
      {"key":"option_1", "value":"1 = Very jarring – Abrupt cuts or time skips that break the illusion of continuity."},
      {"key":"option_2", "value":"2 = Somewhat jumpy – Some confusing or unrealistic jumps."},
      {"key":"option_3", "value":"3 = Neutral – Not smooth, but not distracting either."},
      {"key":"option_4", "value":"4 = Smooth – Transitions are mostly natural and continuous."},
      {"key":"option_5", "value":"5 = Seamless – Very natural and realistic time progression."}
    ]
  },
  {
    "section_text": "Utility of the video instruction",
    "question_text": "[relevance] The video is about the task I asked for in the instruction.",
    "options":[
      {"key":"option_1", "value":"1 = Completely wrong – This is a totally unrelated task (e.g., asked for mango slicing, got paper cutting)."},
      {"key":"option_2", "value":"2 = Mostly wrong – It matched some secondary keywords in my instruction, but clearly not the task the query asked for (e.g., shows peeling a mango, but no slicing)."},
      {"key":"option_3", "value":"3 = Somewhat correct – Related category, but not quite right (e.g., indeed slicing some fruit but not mango)."},
      {"key":"option_4", "value":"4 = Mostly correct – The video is very close to what the query asked for, with minor errors."},
      {"key":"option_5", "value":"5 = Perfect match – This video fully aligns with the request."}
    ]
  },
  {
    "section_text": "Utility of the video instruction",
    "question_text": "[video information precision / relevance] The video stayed focused on the task without unnecessary content.",
    "options":[
      {"key":"option_1", "value":"1 = Very unfocused – Lots of unrelated or distracting content."},
      {"key":"option_2", "value":"2 = Somewhat unfocused – Some extra material that isn’t useful."},
      {"key":"option_3", "value":"3 = Mostly focused – A little fluff, but nothing that really gets in the way."},
      {"key":"option_4", "value":"4 = Well-focused – Almost everything contributes to the goal."},
      {"key":"option_5", "value":"5 = Highly precise – No wasted time, everything is relevant."}
    ]
  },
  {
    "section_text": "Utility of the video instruction",
    "question_text": "[Per step quality] The main action (e.g., slicing, assembling) actually happens on screen.",
    "options":[
      {"key":"option_1", "value":"1 = No action shown – Just a still object or already completed task."},
      {"key":"option_2", "value":"2 = Very little action – The person / object moves, but the main task is skipped."},
      {"key":"option_3", "value":"3 = Some action, but incomplete – Shows part of the action, but it’s unclear or unfinished."},
      {"key":"option_4", "value":"4 = Mostly executed – The action is shown, but could be clearer."},
      {"key":"option_5", "value":"5 = Fully executed – The full action is clearly demonstrated."}
    ]
  },
  {
    "section_text": "Utility of the video instruction",
    "question_text": "[Utility] I feel confident I can correctly do the task after watching this video.",
    "options":[
      {"key":"option_1", "value":"1 = Not at all – I would need to search elsewhere to understand."},
      {"key":"option_2", "value":"2 = Slightly confident – I might attempt it, but I’d probably mess up."},
      {"key":"option_3", "value":"3 = Somewhat confident – I could try it, but I might need to get extra help."},
      {"key":"option_4", "value":"4 = Mostly confident – I can follow along and expect decent results."},
      {"key":"option_5", "value":"5 = Completely confident – I could successfully perform the task right away."},
      {"key":"option_6", "value":"Not Applicable = The query is not task-related -- i.e. the query asks for an explanation."}
    ]
  }
]
